Revit 2017 API
ExternalResourceTypes.BuiltInExternalResourceTypes Properties
The ExternalResourceTypes.BuiltInExternalResourceTypes type exposes the following members.
Properties
Name | Description
AssemblyCodeTable
 An external resource type representing assembly code data.
FabricationConfiguration
 An external resource type representing an MEP fabrication configuration.
KeynoteTable
 An external resource type representing keynote data.
RevitLink
 An external resource type representing Revit Links data.
See Also
ExternalResourceTypes.BuiltInExternalResourceTypes Class
Autodesk.Revit.DB Namespace